Tekla Open API Reference for Tekla Structures 2025
Cloud Properties
The Cloud type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the cloud.
Bulge
 The bulge (curve) to use for the cloud (a bulge is the ratio between the height and width of an object).
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from GraphicObject.)
Points
 The list of points for the cloud. The points you insert will specify the corner points of the cloud. After you insert the object, you will get every cloud point back.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
Cloud Class
Tekla.Structures.Drawing Namespace